case2d/system/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*-----------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
DhW 250;//DhW=0.5W/h0
DhnW -250;//DhW=0.5W/h0
DL  1000;//DL=L/h0
nW	500;
nL	1000;

vertices        
(
    (  0.0 $DhnW -0.5) 
    (  0.0 $DhnW  0.5) 
    (  0.0  $DhW -0.5) 
    (  0.0  $DhW  0.5) 
    ($DL $DhnW -0.5) 
    ($DL $DhnW  0.5) 
    ($DL  $DhW -0.5) 
    ($DL  $DhW  0.5) 
);

blocks          
(
    hex (0  4  6  2  1  5  7  3) ($nL $nW 1) simpleGrading (1 1 1)
);

boundary
(
    inlet 
    {
        type patch;
        faces
        (
            (0  1  3  2 )
        );
    }

    outlet
    {
         type patch;
         faces
         (
            (4  6  7  5)
         );
    }   

    y1 
    {
         type wall;
        faces
        (
            (0  4  5  1)
        );
    }   

    y2 
    {
         type wall;
        faces
        (
            (2  3  7  6)
        );
    }   

    z1 
    {
        type empty;
        faces
        (
            (0  4  6  2)
        );
    }   

    z2 
    {
        type empty;
        faces
        (
            (1  3  7  5)
        );
    }   
);

// ********************************************************************* //

